{
  "service_alerts": [
    {
      "id": "e2d5d268-acab-4718-954a-9cef82ecf4e2",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2021-05-19",
      "start_date": "2021-05-14T02:16:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-05-14T02:16:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-05-19 02:00:00 UTC\r\nEnd Time: 2021-05-19 05:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, London instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "7a2a4728-7b46-4c82-a462-7f8ee1ec472e",
      "region": "fra",
      "subject": "Frankfurt Priority Network Maintenance - 2021-05-13",
      "start_date": "2021-05-06T15:12:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2021-05-06T15:12:00+00:00",
          "message": "Event Type: Network Priority Maintenance\r\n\r\nWe are performing system changes in the Frankfurt location during the following priority network maintenance window. \r\n\r\nStart Time: 2021-05-13 01:00:00 UTC\r\nEnd Time: 2021-05-13 05:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Frankfurt instances may be unreachable for some, or all, of the priority network maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "04cb198e-614a-4e85-ac88-c8175039ba3b",
      "region": "mia",
      "subject": "Miami Priority Network Maintenance - 2021-05-14",
      "start_date": "2021-05-03T15:16:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-05-03T15:16:00+00:00",
          "message": "Event Type: Priority Network Maintenance\r\n\r\nWe are performing system changes in the Miami location during the following priority maintenance window. \r\n \r\n\r\nStart Time: 2021-05-14 07:00:00 UTC\r\nEnd Time: 2021-05-14 11:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Miami instances may be unreachable for some, or all, of the priority maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "227505e3-2945-4ef4-b4f5-3e990dc6ef50",
      "region": "ewr",
      "subject": "New Jersey Emergency Maintenance - 2021-05-13",
      "start_date": "2021-05-03T14:02:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2021-05-03T14:02:00+00:00",
          "message": "Event Type: Network Emergency\r\n\r\nWe are performing system changes in the New Jersey location during the following emergency maintenance window. \r\n\r\nStart Time: 2021-05-13 07:00:00 UTC\r\nEnd Time: 2021-05-13 11:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, New Jersey instances may be unreachable for some, or all, of the emergency maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "34a62ce5-e65a-49e0-ad37-48ddcb29321f",
      "region": "nrt",
      "subject": "Tokyo Emergency Maintenance - 2021-05-12",
      "start_date": "2021-05-03T13:45:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2021-05-03T13:45:00+00:00",
          "message": "Event Type: Network Emergency\r\n\r\nWe are performing system changes in the Tokyo location during the following emergency maintenance window. \r\n\r\nStart Time: 2021-05-12 18:00:00 UTC\r\nEnd Time: 2021-05-12 22:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Tokyo instances may be unreachable for some, or all, of the emergency maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
