{
  "service_alerts": [
    {
      "id": "328f5568-0934-4d56-881e-fe58006bb336",
      "region": "global",
      "subject": "Silicon Valley Container Registry Outage - 2025-03-26",
      "start_date": "2025-03-26T21:53:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-03-26T21:53:00+00:00",
          "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Native team is investigating a partial outage scenario with our Container Registry infrastructure.\r\n\r\nWe are working quickly to restore service to its optimal state."
        }
      ]
    },
    {
      "id": "2b334efc-327b-407c-a5f4-c6dd40a95344",
      "region": "mia",
      "subject": "Miami Degraded Network Performance",
      "start_date": "2025-03-20T11:04:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-03-20T11:04:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Miami location. Our network engineers are actively working with our upstream providers to resolve the issue as quickly as possible."
        }
      ]
    },
    {
      "id": "933e5090-1ea1-4c78-9a92-59782a7194ed",
      "region": "lax",
      "subject": "Los Angeles Scheduled Maintenance - 2025-04-02",
      "start_date": "2025-03-18T20:50:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-03-18T20:50:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Los Angeles location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-04-02 07:00:00 UTC\r\nEnd Time: 2025-04-02 11:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Los Angeles instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
