{
  "service_alerts": [
    {
      "id": "cb568db7-502e-463f-902a-f1c72e6e130e",
      "region": "mia",
      "subject": "Miami Scheduled Maintenance - 2023-08-29",
      "start_date": "2023-08-21T20:51:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-21T20:51:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Miami location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-29 04:00:00 UTC\r\nEnd Time: 2023-08-29 05:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Miami instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "40cbeaf3-12b9-40da-95c6-e239386fce40",
      "region": "global",
      "subject": "Tokyo Degraded Network Performance",
      "start_date": "2023-08-19T13:42:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-08-19T13:42:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Tokyo location. Our network engineers are actively working with our upstream providers to resolve the issue as quickly as possible."
        }
      ]
    },
    {
      "id": "fa8f3929-fac9-43b5-a249-45671be98c4c",
      "region": "sea",
      "subject": "Partial Outage",
      "start_date": "2023-08-18T17:15:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-18T17:15:00+00:00",
          "message": "An outage or maintenance window is affecting a subset of users in this region. Detailed outage information is available in the customer portal if this event is impacting your resources."
        }
      ]
    },
    {
      "id": "6ae5abb5-f29a-43ef-9be2-25a04e89201f",
      "region": "mad",
      "subject": "Madrid Network Outage",
      "start_date": "2023-08-18T13:36:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-18T13:36:00+00:00",
          "message": "We are currently experiencing a partial outage in our Madrid location. Our network engineers are actively working with our upstream providers to restore connectivity as quickly as possible."
        }
      ]
    },
    {
      "id": "97899803-914b-4eff-bc8b-44277d8dd700",
      "region": "blr",
      "subject": "Bangalore Scheduled Maintenance - 2023-08-23",
      "start_date": "2023-08-16T21:41:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-08-16T21:41:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Bangalore location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-23 19:00:00 UTC\r\nEnd Time: 2023-08-23 23:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Bangalore instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "34bc249e-025b-48c0-a0a4-d45dc17eeff6",
      "region": "cdg",
      "subject": "Paris Scheduled Maintenance - 2023-08-22",
      "start_date": "2023-08-16T21:29:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-08-16T21:29:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Paris location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-22 22:00:00 UTC\r\nEnd Time: 2023-08-23 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Paris instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "54178370-fc0a-42f5-8f27-b5e646d3d091",
      "region": "bom",
      "subject": "Mumbai Scheduled Maintenance - 2023-08-22",
      "start_date": "2023-08-09T19:27:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-08-09T19:27:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Mumbai location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-22 20:00:00 UTC\r\nEnd Time: 2023-08-23 24:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Mumbai instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "c3f12dcd-a7ae-4d26-9e53-3944bcec87fa",
      "region": "icn",
      "subject": "Seoul Scheduled Maintenance - 2023-08-22",
      "start_date": "2023-08-09T19:06:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-08-09T19:06:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Seoul location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-22 16:00:00 UTC\r\nEnd Time: 2023-08-22 20:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Seoul instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "d206ecaf-ded4-4c4c-a7db-bfb634a65372",
      "region": "syd",
      "subject": "Sydney Scheduled Maintenance - 2023-08-24",
      "start_date": "2023-08-08T21:16:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-08T21:16:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Sydney location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-24 16:00:00 UTC\r\nEnd Time: 2023-08-24 20:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Sydney instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "46e28fb6-3a9d-467a-a3a7-9cbb670ea9c4",
      "region": "mad",
      "subject": "Madrid Scheduled Maintenance - 2023-08-23",
      "start_date": "2023-08-08T21:13:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-08-08T21:13:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Madrid location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-08-23 22:00:00 UTC\r\nEnd Time: 2023-08-24 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Madrid instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "8cfc5dd4-d846-4e2a-b539-b4af3c27bbfd",
      "region": "ewr",
      "subject": "New Jersey Object Storage Outage - 2023-08-06",
      "start_date": "2023-08-06T07:18:00+00:00",
      "updated_at": "2023-08-14T16:03:00+00:00",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-14T16:03:00+00:00",
          "message": "Hello,\r\n\r\nWe are providing an update on restoration progress regarding the extended outage to the Object Storage platform (VOBS) in the New Jersey (EWR) location.\r\n\r\nAt this time, we are continuing to work to bring VOBS EWR back to normal health. Some or all of your data may be accessible at this time, either constantly or intermittently. Rebalancing continues as anticipated and we expect to reach a state where acceptable read performance is available soon. As part of this, we are continuing to retrofit new, more performant hardware in VOBS EWR. Once we have achieved an acceptable level of read availability, we will work to restore write access, and lastly performance to normal levels. Please note that we are making every effort to safely expedite this process and minimize the additional impact time.\r\n\r\nThank you for your patience as we work through this outage.\r\n\r\nWe will continue to provide regular updates until normal performance is restored."
        },
        {
          "updated_at": "2023-08-09T19:26:00+00:00",
          "message": "Hello,\r\n\r\nPlease review the following information regarding the remediation of an extended outage to the Object Storage platform (VOBS) in the New Jersey (EWR) location. The outage occurred as a result of surging demand before our planned incremental hardware retrofit (to match our NVMe based clusters in other locations) could be completed and the cluster was not able to consistently perform routine balancing operations.  \r\n\r\nOur team’s restoration priorities are preventing data loss, followed by data availability, restoring write access, and finally performance. While user access is limited, the cluster is actively rebalancing and is expected to reach an acceptable read state soon. In the meantime, you should find that objects can be read with intermittent success, retries may produce the best results.\r\n\r\n\r\nVOBS in other locations (SJC1, AMS1, BLR1 & DEL1) already have high performance NVMe storage in place and we recommend creating a new VOBS subscription there for your workloads while the extended maintenance efforts in EWR are completed. While we expect your access to VOBS EWR to be restored soon, the platform will be under higher load than normal during the hardware replacement process over the next few weeks. \r\n\r\nWe will provide regular updates until normal read/write access is restored."
        },
        {
          "updated_at": "2023-08-06T07:18:00+00:00",
          "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Storage team is investigating a partial outage situation with our Object Storage infrastructure. The following services may be impacted by this event:\r\n\r\n- Object Storage Subscription management\r\n- Adding or removing buckets\r\n- S3 client issues\r\n\r\nWe are working quickly to restore service to its optimal state."
        }
      ]
    },
    {
      "id": "a32c33f1-5a62-46e1-ae7c-12162342e230",
      "region": "sgp",
      "subject": "Singapore Object Storage Outage - 2023-08-04",
      "start_date": "2023-08-03T01:46:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-03T01:46:00+00:00",
          "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Storage team is investigating a partial outage situation with our Object Storage infrastructure. The following services may be impacted by this event:\r\n\r\n- Object Storage Subscription management\r\n- Adding or removing buckets\r\n- S3 client issues\r\n\r\nWe are working quickly to restore service to its optimal state."
        }
      ]
    },
    {
      "id": "a4db6022-d78b-4e0a-909f-c2e9327baf9a",
      "region": "ewr",
      "subject": "New Jersey Object Storage Outage - 2023-06-09",
      "start_date": "2023-06-09T16:40:00+00:00",
      "updated_at": "2023-08-05T07:19:00+00:00",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-08-05T07:19:00+00:00",
          "message": "[ New Jersey Object Storage Update ]\r\n\r\nAffected Product : New Jersey Object Storage\r\n\r\nThere are an increased number of reports regarding performance and timeouts. These issues are currently being addressed to bring object storage to a more optimal state."
        },
        {
          "updated_at": "2023-07-19T19:49:00+00:00",
          "message": "[ New Jersey Object Storage Maintenance Update ]\r\n\r\nAffected Product : New Jersey Object Storage \r\nMaintenance Date : Monday, July 24\r\n\r\nFurther maintenance and upgrades will be conducted for the New Jersey Object Storage product starting on Monday, July 24.  Customers may observe some performance disruption and client access timeouts for New Jersey object storage subscriptions during this work.\r\n\r\nThank you for your patience and understanding."
        },
        {
          "updated_at": "2023-06-09T16:40:00+00:00",
          "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Storage team is investigating a partial outage situation with our Object Storage infrastructure. The following services may be impacted by this event:\r\n\r\n- Object Storage Subscription management\r\n- Adding or removing buckets\r\n- S3 client issues\r\n\r\nWe are working quickly to restore service to its optimal state."
        }
      ]
    }
  ]
}
