{
  "service_alerts": [
    {
      "id": "9aef46ae-082e-4b1a-b34c-ebecf3afbb8c",
      "region": "ewr",
      "subject": "New Jersey Deployment Delays",
      "start_date": "2025-10-08T16:17:00+00:00",
      "updated_at": "2025-10-08T18:20:00+00:00",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-10-08T18:20:00+00:00",
          "message": "Efforts are still on-going to fully normalize the affected New Jersey services.   Significant progress has been made, and is expected to continue accelerating.  Investigation into the root cause has simultaneously and independently begun.\r\n\r\nThank you for your patience and understanding."
        },
        {
          "updated_at": "2025-10-08T16:44:00+00:00",
          "message": "The scope of impact for this New Jersey issue has widened.   Currently affected products include not only new deployments, but HDD Block Storage and new VPS backup captures as well.   We are actively working on the cause and will post further updates as the situation evolves.\r\n\r\nThank you for your patience and understanding."
        },
        {
          "updated_at": "2025-10-08T16:17:00+00:00",
          "message": "Some customers are currently experiencing slower than normal instance deployment times in our New Jersey location. Our engineering team is aware of this issue and is working diligently to resolve this as quickly as possible."
        }
      ]
    },
    {
      "id": "485b504c-07f3-45a8-9141-5ffb5e87b0a7",
      "region": "sea",
      "subject": "Seattle Degraded Network Performance",
      "start_date": "2025-10-07T17:16:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2025-10-07T17:16:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Sattle location. Our network engineers are actively working with our upstream providers to resolve the issue as quickly as possible."
        }
      ]
    },
    {
      "id": "7f4f4e29-f65e-4933-87c5-110f10b63775",
      "region": "cdg",
      "subject": "Paris Scheduled Maintenance - 2025-10-07",
      "start_date": "2025-09-29T20:25:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2025-09-29T20:25:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Paris location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-10-07 22:00:00 UTC\r\nEnd Time: 2025-10-08 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Paris instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "eff0a7fc-3e34-4386-9ca7-27c93ef7dc43",
      "region": "bom",
      "subject": "Mumbai Degraded Network Performance",
      "start_date": "2025-09-08T19:06:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-09-08T19:06:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Bangalore location with international connectivity to India.  You may experience slower speeds or intermittent connectivity across all of our upstream transit providers. We will provide updates as more information becomes available."
        }
      ]
    }
  ]
}
