{
  "service_alerts": [
    {
      "id": "ac52c6b5-47b2-4706-ae0d-3eebd3d00b9e",
      "region": "del",
      "subject": "Delhi NCR Scheduled Maintenance - 2022-09-22",
      "start_date": "2022-09-12T20:14:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-12T20:14:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Delhi NCR location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-22 20:00:00 UTC\r\nEnd Time: 2022-09-23 24:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Delhi NCR instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "3f03187a-fb60-46a5-9166-863c781be7b3",
      "region": "blr",
      "subject": "Bangalore Scheduled Maintenance - 2022-09-19",
      "start_date": "2022-09-12T18:56:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-12T18:56:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Bangalore location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-19 22:00:00 UTC\r\nEnd Time: 2022-09-20 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Bangalore instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "0952208d-8ee1-428e-9b2d-0ffc3f8af65e",
      "region": "sto",
      "subject": "Stockholm Scheduled Maintenance - 2022-09-19",
      "start_date": "2022-09-12T18:14:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-12T18:14:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Stockholm location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-19 23:00:00 UTC\r\nEnd Time: 2022-09-20 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Stockholm instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "f92ddd9f-dc30-4386-ab27-38d0984ff91b",
      "region": "mel",
      "subject": "Melbourne Scheduled Maintenance - 2022-09-14",
      "start_date": "2022-09-07T14:42:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-07T14:42:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Melbourne location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-14 15:00:00 UTC\r\nEnd Time: 2022-09-14 19:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Melbourne instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "b1f8811a-c232-42a6-9981-c0543dd1e047",
      "region": "dfw",
      "subject": "Dallas Scheduled Maintenance - 2022-09-13",
      "start_date": "2022-09-07T14:40:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-07T14:40:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Dallas location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-13 06:00:00 UTC\r\nEnd Time: 2022-09-13 10:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Dallas instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "d459f32f-1bd3-4a18-a67d-3366e6246f4a",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2022-09-13",
      "start_date": "2022-09-07T14:33:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-07T14:33:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-13 22:00:00 UTC\r\nEnd Time: 2022-09-14 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Frankfurt instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "7c787cf1-ccab-4c08-a978-7168ffd5de70",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2022-09-12",
      "start_date": "2022-09-01T16:34:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-09-01T16:34:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-12 23:00:00 UTC\r\nEnd Time: 2022-09-13 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
