{
  "service_alerts": [
    {
      "id": "f92ddd9f-dc30-4386-ab27-38d0984ff91b",
      "region": "mel",
      "subject": "Melbourne Scheduled Maintenance - 2022-09-14",
      "start_date": "2022-09-07T14:42:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-07T14:42:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Melbourne location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-14 15:00:00 UTC\r\nEnd Time: 2022-09-14 19:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Melbourne instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "b1f8811a-c232-42a6-9981-c0543dd1e047",
      "region": "dfw",
      "subject": "Dallas Scheduled Maintenance - 2022-09-13",
      "start_date": "2022-09-07T14:40:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-07T14:40:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Dallas location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-13 06:00:00 UTC\r\nEnd Time: 2022-09-13 10:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Dallas instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "d459f32f-1bd3-4a18-a67d-3366e6246f4a",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2022-09-13",
      "start_date": "2022-09-07T14:33:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-07T14:33:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-13 22:00:00 UTC\r\nEnd Time: 2022-09-14 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Frankfurt instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "7c787cf1-ccab-4c08-a978-7168ffd5de70",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2022-09-12",
      "start_date": "2022-09-01T16:34:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-09-01T16:34:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-12 23:00:00 UTC\r\nEnd Time: 2022-09-13 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "bf493334-77b4-4106-a3b1-ee61b42208c3",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2022-09-08",
      "start_date": "2022-09-01T15:43:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-09-01T15:43:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-08 04:05:00 UTC\r\nEnd Time: 2022-09-08 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Chicago instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "8572b426-e6c1-407e-b4b3-e9067d9b2f8e",
      "region": "sgp",
      "subject": "Singapore Scheduled Maintenance - 2022-09-07",
      "start_date": "2022-09-01T15:11:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-09-01T15:11:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Singapore location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-09-07 16:00:00 UTC\r\nEnd Time: 2022-09-07 20:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Singapore instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
