{
  "service_alerts": [
    {
      "id": "3ea4c532-eff5-4788-8d94-e26c3f9bdfe0",
      "region": "ams",
      "subject": "Amsterdam Partial Deployment and Platform Outage",
      "start_date": "2022-07-21T20:14:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-07-21T20:14:00+00:00",
          "message": "Some customers are currently experiencing platform issues in our Amsterdam location.  New deployments and platform-related actions may be unavailable.  Our engineering team is aware of this issue and is working diligently to resolve this as quickly as possible."
        }
      ]
    },
    {
      "id": "568ee3cc-deca-4771-b1c2-9c50af55b671",
      "region": "atl",
      "subject": "Atlanta Scheduled Maintenance - 2022-07-25",
      "start_date": "2022-07-20T18:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-20T18:18:00+00:00",
          "message": "Updated*** Event Type: Network Upgrade\r\n\r\nWe are performing Bare metal system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-25 18:00:00 UTC\r\nEnd Time: 2022-07-25 22:00:00 UTC\r\n\r\n\r\nServers will remain powered on and there will be no interruption to Public or VPC network connectivity, however system controls will be affected.  During this Maintenance Window you will be unable to issue Power On/Off/Cycle commands, access the VNC Console, deploy new servers, or reinstall existing subscriptions."
        }
      ]
    },
    {
      "id": "ab7fd27d-217e-4949-8994-fde7339d681f",
      "region": "nrt",
      "subject": "Tokyo Baremetal Scheduled Maintenance - 2022-07-25",
      "start_date": "2022-07-20T15:25:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-20T15:25:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing Baremetal system changes in the Tokyo location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-25 16:00:00 UTC\r\nEnd Time: 2022-07-25 20:00:00 UTC\r\n\r\n\r\nBaremetal servers will remain powered on and there will be no interruption to Public or VPC network connectivity, however system controls will be affected.  During this Maintenance Window you will be unable to issue Power On/Off/Cycle commands, access the VNC Console, deploy new servers, or reinstall existing subscriptions.\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Tokyo instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
