{
  "service_alerts": [
    {
      "id": "1ba0ad20-6260-479c-8a8d-578ecd442968",
      "region": "dfw",
      "subject": "Dallas Network Outage",
      "start_date": "2025-06-04T11:54:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-06-04T11:54:00+00:00",
          "message": "We are currently experiencing a partial outage in our Dallas location. Our network engineers are actively working with our upstream providers to restore connectivity as quickly as possible."
        }
      ]
    },
    {
      "id": "c164d32d-7df7-4d21-add9-cae6932ab830",
      "region": "global",
      "subject": "VKE Outage - 2025-06-02",
      "start_date": "2025-06-02T14:36:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2025-06-02T14:36:00+00:00",
          "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Native team is investigating a partial outage situation with our VKE infrastructure. The following services may be impacted by this event:\r\n\r\n- Retrieving new copies of cluster kubeconfig files \r\n\r\nWe are working quickly to restore service to its optimal state."
        }
      ]
    },
    {
      "id": "d6cb2515-2309-4e45-a059-47e675a99abb",
      "region": "bom",
      "subject": "Mumbai Scheduled Maintenance - 2025-06-10",
      "start_date": "2025-06-02T14:26:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-06-02T14:26:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Mumbai location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-06-10 18:30:00 UTC\r\nEnd Time: 2025-06-11 00:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Mumbai instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "474bd820-77de-40cf-b298-82c7fd991f09",
      "region": "atl",
      "subject": "Atlanta Scheduled Maintenance - 2025-06-05",
      "start_date": "2025-05-30T13:19:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-05-30T13:19:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-06-05 05:00:00 UTC\r\nEnd Time: 2025-06-05 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Atlanta instances will be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
