{
  "service_alerts": [
    {
      "id": "5fb3b3dd-5e99-49cc-9081-bde637a2bb14",
      "region": "syd",
      "subject": "Sydney Degraded Network Performance",
      "start_date": "2023-03-25T23:38:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-03-25T23:38:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Sydney location. Our network engineers are actively working with our upstream providers to resolve the issue as quickly as possible."
        }
      ]
    },
    {
      "id": "05334518-aded-4083-a356-0a6ea0760363",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2023-03-30",
      "start_date": "2023-03-23T15:24:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-23T15:24:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-03-30 24:00:00 UTC\r\nEnd Time: 2023-03-30 04:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "0a495a46-52af-4d21-9f8b-b34bdd8ecdc9",
      "region": "global",
      "subject": "Control Portal & API Scheduled Maintenance - 2023-03-27",
      "start_date": "2023-03-22T18:39:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-22T18:39:00+00:00",
          "message": "Event Type: Provisioning platform upgrade\r\n\r\nIn an effort to continuously enhance the customer experience, we are performing routine maintenance on my.vultr.com and api.vultr.com during the following scheduled maintenance window: \r\n\r\nStart Time: 2023-03-27 20:00:00 UTC\r\nEnd Time: 2023-03-27 22:00:00 UTC\r\n\r\nThis maintenance affects Vultr provisioning and management systems only. During this maintenance window deploying or managing instances via API or my.vultr.com may be unavailable for brief periods of time, but the normal operation of your Vultr instances and infrastructure will not be affected. Provisioning or management attempts during this time may timeout or fail, if so, please wait a few minutes and try again.\r\n\r\nThe 2 hour window is a precautionary measure and the work is expected to be very brief.  Please feel free to open a support ticket with any questions or concerns."
        }
      ]
    },
    {
      "id": "5b6e384c-8b75-499c-9c6d-669c6ac64fd1",
      "region": "sgp",
      "subject": "Singapore Scheduled Maintenance - 2023-03-28",
      "start_date": "2023-03-21T15:58:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-21T15:58:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Singapore location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-03-28 16:30:00 UTC\r\nEnd Time: 2023-03-28 20:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Singapore instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "55146523-b825-490f-87c0-b58b0e93144c",
      "region": "nrt",
      "subject": "Partial Outage",
      "start_date": "2023-03-21T13:56:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-21T13:56:00+00:00",
          "message": "An outage or maintenance window is affecting a subset of users in this region. Detailed outage information is available in the customer portal if this event is impacting your resources."
        }
      ]
    },
    {
      "id": "1880d4d2-ba9a-4bb8-9760-7069c33fe834",
      "region": "waw",
      "subject": "Scheduled Maintenance - 2023-03-25",
      "start_date": "2023-03-16T23:54:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-03-16T23:54:00+00:00",
          "message": "Event Type: Software Upgrade\r\nStart Time: 2023-03-25 02:05:00 UTC\r\nEnd Time: 2023-03-25 06:05:00 UTC\r\n\r\nWe will be performing software upgrades in this location as part of an ongoing effort to maintain an ideal hosting environment. During the course of this maintenance window, your instance will be rebooted, and will be unavailable for several minutes. Please be aware that as we do not have access to your filesystem, this reboot will not be as clean as if it were done from within your OS, so preparing your software/filesystem with a graceful shutdown of services and the VPS itself would be advised."
        }
      ]
    }
  ]
}
