{
  "service_alerts": [
    {
      "id": "1eb52819-429d-45e3-a7c1-f2c856be2c72",
      "region": "ord",
      "subject": "Chicago Emergency Maintenance - 2024-08-20",
      "start_date": "2024-08-19T19:27:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2024-08-19T19:27:00+00:00",
          "message": "Event Type: Network Emergency\r\n\r\nWe are performing system changes in the Chicago location during the following emergency maintenance window. \r\n\r\nStart Time: 2024-08-20 05:00:00 UTC\r\nEnd Time: 2024-08-20 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the emergency maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "27077c32-b15d-46ed-8c97-9fd44eddcdab",
      "region": "sgp",
      "subject": "Singapore Emergency Maintenance - 2024-08-19",
      "start_date": "2024-08-19T19:07:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2024-08-19T19:07:00+00:00",
          "message": "Event Type: Network Emergency\r\n\r\nWe are performing system changes in the Singapore location during the following emergency maintenance window. \r\n\r\nStart Time: 2024-08-19 20:15:00 UTC\r\nEnd Time: 2024-08-20 00:15:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Singapore instances may be unreachable for some, or all, of the emergency maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "74c8ce38-f20e-42c3-9627-751bf9492cde",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2024-08-28",
      "start_date": "2024-08-19T14:14:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-08-19T14:14:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-28 05:00:00 UTC\r\nEnd Time: 2024-08-28 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Chicago instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "ab6ba0a7-a54e-469d-8381-fae6e37afabc",
      "region": "mia",
      "subject": "Miami Scheduled Maintenance - 2024-08-29",
      "start_date": "2024-08-16T17:58:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-08-16T17:58:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Miami location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-29 04:00:00 UTC\r\nEnd Time: 2024-08-29 08:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Miami instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "30337b37-25be-47ba-b19d-a644b0cbfc2b",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2024-08-28",
      "start_date": "2024-08-16T17:55:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-08-16T17:55:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-28 22:00:00 UTC\r\nEnd Time: 2024-08-29 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Frankfurt instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "5c5f3b7e-b79e-441b-825f-091d988dcd9c",
      "region": "hnl",
      "subject": "Honolulu Scheduled Maintenance - 2024-08-27",
      "start_date": "2024-08-16T17:49:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-08-16T17:49:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Honolulu location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-27 10:00:00 UTC\r\nEnd Time: 2024-08-27 14:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Honolulu instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "27487981-d1cc-49de-a3e4-4ca4b2160408",
      "region": "mel",
      "subject": "Melbourne Scheduled Maintenance - 2024-08-27",
      "start_date": "2024-08-16T17:46:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-08-16T17:46:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Melbourne location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-27 14:00:00 UTC\r\nEnd Time: 2024-08-27 18:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Melbourne instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "da0225aa-6474-4b2a-bacd-8b1a11ca4222",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2024-08-21",
      "start_date": "2024-08-16T17:32:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-08-16T17:32:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-21 23:00:00 UTC\r\nEnd Time: 2024-08-22 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "21661762-6c60-4646-8826-51fd10b2cae0",
      "region": "sjc",
      "subject": "Silicon Valley Scheduled Maintenance - 2024-08-20",
      "start_date": "2024-08-14T13:02:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2024-08-14T13:02:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Silicon Valley location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-08-20 10:00:00 UTC\r\nEnd Time: 2024-08-20 14:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Silicon Valley instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "c79501db-32db-49b6-a8bb-46c0529f3452",
      "region": "tlv",
      "subject": "Potential service disruption in Tel Aviv",
      "start_date": "2023-10-17T16:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-10-17T16:18:00+00:00",
          "message": "The Constant Company, creator of Vultr, is aware of and following the situation in Israel. At this time we do not expect any disruption of service in our Tel Aviv location.  We will continue to closely monitor services as the situation evolves, and we will advise our customers of any changes which have the potential to impact service delivery.\r\n\r\nWe believe this is a crucial time to remind our customers about the importance of the 3-2-1 Backup Strategy for safeguarding all critical data. Please see the case study here for more information: https://www.vultr.com/docs/case-study-use-a-321-backup-strategy-at-vultr/\r\n\r\nPlease note that Vultr Snapshots and Backups are stored in the same location as the instance they are made from, however when you deploy a new instance from them in a different location, they will be automatically transferred and stored in the new location as well."
        }
      ]
    }
  ]
}
