{
  "service_alerts": [
    {
      "id": "c4d3a598-3fbf-4e6b-9031-efba21005b2b",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2025-06-18",
      "start_date": "2025-06-11T21:48:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-06-11T21:48:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-06-18 05:05:00 UTC\r\nEnd Time: 2025-06-18 09:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "d19f7877-9278-4b6f-aa2e-55935ee1e173",
      "region": "sea",
      "subject": "Seattle Scheduled Maintenance - 2025-06-17",
      "start_date": "2025-06-11T16:29:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-06-11T16:29:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Seattle location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-06-17 07:05:00 UTC\r\nEnd Time: 2025-06-17 11:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Seattle instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "ade721fd-5114-448a-b354-bf3ff29a06aa",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2025-06-19",
      "start_date": "2025-06-11T15:04:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-06-11T15:04:00+00:00",
          "message": "Event Type: Systems Upgrade\r\n\r\nWe are performing system upgrades in the Chicago location during the following scheduled maintenance window.\r\n\r\nStart Time: 2025-06-19 13:00:00 UTC\r\nEnd Time: 2025-06-19 21:00:00 UTC\r\n\r\nThese changes are limited to Storage products in the Chicago location, including:\r\n\r\n- Vultr Filesystem\r\n- Vultr Block Storage\r\n- Vultr Object Storage\r\n- Storage Gateways\r\n\r\nOur engineers make every effort to minimize system impact; however, the services noted above may be unreachable in Chicago for some of the scheduled maintenance window as we perform host upgrades."
        }
      ]
    },
    {
      "id": "d6cb2515-2309-4e45-a059-47e675a99abb",
      "region": "bom",
      "subject": "Mumbai Scheduled Maintenance - 2025-06-10",
      "start_date": "2025-06-02T14:26:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2025-06-02T14:26:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Mumbai location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-06-10 18:30:00 UTC\r\nEnd Time: 2025-06-11 00:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Mumbai instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
