{
  "service_alerts": [
    {
      "id": "94e69cf9-4027-4222-ad7e-5d3a2fb491b4",
      "region": "nrt",
      "subject": "Tokyo NVMe Block Storage Upgrades - 2024-02-20",
      "start_date": "2024-02-14T19:24:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-02-14T19:24:00+00:00",
          "message": "Event Type: NVMe Block Storage Infrastructure Maintenance\r\nStart Time: 2024-02-20 23:00:00 Asia/Tokyo\r\nEnd Time: 2024-02-21 09:00:00 Asia/Tokyo\r\n\r\nOur Cloud Storage team will be performing upgrades to our Tokyo NVMe Block Storage infrastructure starting at 2024-02-20 23:00:00 Asia/Tokyo (14:00:00 UTC). During this maintenance window, creating, attaching, resizing, and deletion of NVMe Block Storage volumes may be temporarily unavailable.\r\n\r\nPreviously deployed NVMe Block Storage volumes in Tokyo will remain online without interruption and will not be impacted by this event."
        }
      ]
    },
    {
      "id": "007a7e8d-562b-4b53-9605-26d4055e4734",
      "region": "atl",
      "subject": "Atlanta Scheduled Maintenance - 2024-03-05",
      "start_date": "2024-02-09T19:45:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-02-09T19:45:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-03-05 03:00:00 UTC\r\nEnd Time: 2024-03-05 07:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Atlanta instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "dde4419e-87c7-419f-a8d4-7575de8b4c21",
      "region": "blr",
      "subject": "Bangalore NVMe Block Storage Upgrades - 2024-02-14",
      "start_date": "2024-02-08T19:12:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-02-08T19:12:00+00:00",
          "message": "Event Type: NVMe Block Storage Infrastructure Maintenance\r\nStart Time: 2024-02-14 21:30:00 Asia/Kolkata\r\nEnd Time: 2024-02-15 03:30:00 Asia/Kolkata\r\n\r\nOur Cloud Storage team will be performing upgrades to our Bangalore NVMe Block Storage infrastructure starting at 2024-02-14 21:30 Asia/Kolkata (16:00:00) UTC. During this maintenance window, creating, attaching, resizing, and deletion of NVMe Block Storage volumes may be temporarily unavailable.\r\n\r\nPreviously deployed NVMe Block Storage volumes in Bangalore will remain online without interruption and will not be impacted by this event."
        }
      ]
    },
    {
      "id": "5ef52fdd-34be-49f7-b941-b45736853807",
      "region": "yto",
      "subject": "Toronto HDD Block Storage Upgrades - 2024-02-13",
      "start_date": "2024-02-07T19:24:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2024-02-07T19:24:00+00:00",
          "message": "Event Type: HDD Block Storage Infrastructure Maintenance\r\nStart Time: 2024-02-13 10:00:00 America/Toronto\r\nEnd Time: 2024-02-13 16:00:00 America/Toronto\r\n\r\nOur Cloud Storage team will be performing upgrades to our Toronto HDD Block Storage infrastructure starting at 2024-02-12 10:00:00 EST (15:00:00 UTC). During this maintenance window, creating, attaching, resizing, and deletion of HDD Block Storage volumes may be temporarily unavailable.\r\n\r\nPreviously deployed HDD Block Storage volumes in Toronto will remain online without interruption and will not be impacted by this event."
        }
      ]
    },
    {
      "id": "c79501db-32db-49b6-a8bb-46c0529f3452",
      "region": "tlv",
      "subject": "Potential service disruption in Tel Aviv",
      "start_date": "2023-10-17T16:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-10-17T16:18:00+00:00",
          "message": "The Constant Company, creator of Vultr, is aware of and following the situation in Israel. At this time we do not expect any disruption of service in our Tel Aviv location.  We will continue to closely monitor services as the situation evolves, and we will advise our customers of any changes which have the potential to impact service delivery.\r\n\r\nWe believe this is a crucial time to remind our customers about the importance of the 3-2-1 Backup Strategy for safeguarding all critical data. Please see the case study here for more information: https://www.vultr.com/docs/case-study-use-a-321-backup-strategy-at-vultr/\r\n\r\nPlease note that Vultr Snapshots and Backups are stored in the same location as the instance they are made from, however when you deploy a new instance from them in a different location, they will be automatically transferred and stored in the new location as well."
        }
      ]
    }
  ]
}
