{
  "service_alerts": [
    {
      "id": "0e45654a-0bfd-4ee1-9906-6391450f62cc",
      "region": "mad",
      "subject": "Madrid Scheduled Maintenance - 2024-05-01",
      "start_date": "2024-04-12T18:22:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-12T18:22:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Madrid location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-05-01 20:30:00 UTC\r\nEnd Time: 2024-05-02 00:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Madrid instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "fe9f4bba-8686-496c-ae72-4b8056708769",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2024-04-30",
      "start_date": "2024-04-12T18:19:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-12T18:19:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-30 20:30:00 UTC\r\nEnd Time: 2024-05-01 00:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Frankfurt instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "e3d1584e-dffd-4209-8de7-48f2dd1a39a2",
      "region": "jnb",
      "subject": "Johannesburg Scheduled Maintenance - 2024-04-29",
      "start_date": "2024-04-12T18:16:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-12T18:16:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Johannesburg location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-29 20:30:00 UTC\r\nEnd Time: 2024-04-30 00:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Johannesburg instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "ddac43c8-efb6-4b73-8568-132712e325bf",
      "region": "tlv",
      "subject": "Tel Aviv Scheduled Maintenance - 2024-04-18",
      "start_date": "2024-04-11T19:39:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-11T19:39:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Tel Aviv location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-18 21:00:00 UTC\r\nEnd Time: 2024-04-19 01:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Tel Aviv instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "d03ae0fa-b9b3-4767-a68b-c34f7cb1f19e",
      "region": "icn",
      "subject": "Seoul Scheduled Maintenance - 2024-04-17",
      "start_date": "2024-04-11T19:27:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-11T19:27:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Seoul location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-17 15:00:00 UTC\r\nEnd Time: 2024-04-17 19:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Seoul instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "c55fb4db-ddb1-4e8e-a7e4-fd126f1039d7",
      "region": "bom",
      "subject": "Mumbai Scheduled Maintenance - 2024-04-16",
      "start_date": "2024-04-11T19:14:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-11T19:14:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Mumbai location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-16 19:00:00 UTC\r\nEnd Time: 2024-04-16 23:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Mumbai instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "da82e02d-c3c2-4d40-92b3-05b09f40c22b",
      "region": "ams",
      "subject": "Amsterdam Scheduled Maintenance - 2024-04-16",
      "start_date": "2024-04-11T19:09:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2024-04-11T19:09:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Amsterdam location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-16 22:00:00 UTC\r\nEnd Time: 2024-04-17 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Amsterdam instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "9300ea86-6ee7-430a-80b4-5adf6d36e8a2",
      "region": "syd",
      "subject": "Sydney Scheduled Maintenance - 2024-04-11",
      "start_date": "2024-04-05T19:30:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2024-04-05T19:30:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Sydney location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-11 14:00:00 UTC\r\nEnd Time: 2024-04-11 18:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Sydney instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "83041043-8e71-4182-a1b8-d21dabfc745f",
      "region": "atl",
      "subject": "Atlanta Scheduled Maintenance - 2024-04-11",
      "start_date": "2024-04-05T17:41:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2024-04-05T17:41:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2024-04-11 01:30:00 UTC\r\nEnd Time: 2024-04-11 05:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Atlanta instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "c79501db-32db-49b6-a8bb-46c0529f3452",
      "region": "tlv",
      "subject": "Potential service disruption in Tel Aviv",
      "start_date": "2023-10-17T16:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-10-17T16:18:00+00:00",
          "message": "The Constant Company, creator of Vultr, is aware of and following the situation in Israel. At this time we do not expect any disruption of service in our Tel Aviv location.  We will continue to closely monitor services as the situation evolves, and we will advise our customers of any changes which have the potential to impact service delivery.\r\n\r\nWe believe this is a crucial time to remind our customers about the importance of the 3-2-1 Backup Strategy for safeguarding all critical data. Please see the case study here for more information: https://www.vultr.com/docs/case-study-use-a-321-backup-strategy-at-vultr/\r\n\r\nPlease note that Vultr Snapshots and Backups are stored in the same location as the instance they are made from, however when you deploy a new instance from them in a different location, they will be automatically transferred and stored in the new location as well."
        }
      ]
    }
  ]
}
