{
  "service_alerts": [
    {
      "id": "420b6cef-724e-437f-bc70-091b07a6cda4",
      "region": "fra",
      "subject": "Frankfurt Network Outage",
      "start_date": "2026-02-19T12:56:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2026-02-19T12:56:00+00:00",
          "message": "We are currently experiencing a partial outage in our Frankfurt location. Our network engineers are actively working with our upstream providers to restore connectivity as quickly as possible."
        }
      ]
    },
    {
      "id": "80e0d0dc-347c-4696-97a6-409a1ab3c601",
      "region": "ams",
      "subject": "Amsterdam Scheduled Maintenance - 2026-02-26",
      "start_date": "2026-02-17T15:58:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2026-02-17T15:58:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Amsterdam location during the following scheduled maintenance window. \r\n\r\nStart Time: 2026-02-26 23:00:00 UTC\r\nEnd Time: 2026-02-27 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Amsterdam instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "39116e6e-d30a-4d8e-b95e-85a81f6dd874",
      "region": "lhr",
      "subject": "London Emergency Maintenance - 2026-02-17",
      "start_date": "2026-02-17T08:57:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2026-02-17T08:57:00+00:00",
          "message": "Event Type: Network Emergency\r\n\r\nWe are performing system changes in the London location during the following emergency maintenance window. \r\n\r\nStart Time: 2026-02-20 08:50:00 UTC\r\nEnd Time: 2026-02-20 12:50:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, London instances may be unreachable for some, or all, of the emergency maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "47aaac60-2923-40aa-a2b0-005675239ba0",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2026-02-18",
      "start_date": "2026-02-12T20:48:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2026-02-12T20:48:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2026-02-18 06:00:00 UTC\r\nEnd Time: 2026-02-18 10:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "2ea272ae-237f-4a1c-9c9d-07029e65f0f6",
      "region": "yto",
      "subject": "Toronto Scheduled Maintenance - 2026-02-18",
      "start_date": "2026-02-12T16:43:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2026-02-12T16:43:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Toronto location during the following scheduled maintenance window. \r\n\r\nStart Time: 2026-02-18 05:05:00 UTC\r\nEnd Time: 2026-02-18 09:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Toronto instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "4f634573-460d-4b4a-bf58-d8b188138b95",
      "region": "global",
      "subject": "Scheduled Maintenance - 2026-02-24",
      "start_date": "2026-02-10T15:34:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2026-02-10T15:34:00+00:00",
          "message": "Event Type: Software Upgrade\r\nStart Time: 2026-02-24 18:30:00 UTC\r\nEnd Time: 2026-02-24 19:30:00 UTC\r\n\r\nWe will be performing software upgrades in this location as part of an ongoing effort to maintain an ideal hosting environment. During the course of this maintenance window, the load-balancer service will be restarted; this should result in only a few moments of traffic interruption. Your instances will remain powered on and their local services will be unaffected, so no action on your part is required."
        }
      ]
    },
    {
      "id": "8685f586-f946-4800-b843-4bc47e2ea411",
      "region": "ewr",
      "subject": "New Jersey Scheduled Maintenance - 2026-02-19",
      "start_date": "2026-01-27T17:03:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2026-01-27T17:03:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the New Jersey location during the following scheduled maintenance window. \r\n\r\nStart Time: 2026-02-19 05:05:00 UTC\r\nEnd Time: 2026-02-19 09:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to New Jersey instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
