{
  "service_alerts": [
    {
      "id": "b13d6857-0d89-4ca6-bd31-d58dd6b7804a",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2022-07-13",
      "start_date": "2022-07-01T20:05:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-01T20:05:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-13 14:00:00 UTC\r\nEnd Time: 2022-07-13 20:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Frankfurt instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "8ea3177b-b318-4bf4-987f-ef2d48927ad8",
      "region": "dfw",
      "subject": "Dallas Scheduled Maintenance - 2022-07-06",
      "start_date": "2022-07-01T10:54:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-01T10:54:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Dallas location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-06 05:00:00 UTC\r\nEnd Time: 2022-07-06 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Dallas instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "f8e10715-7e4b-4c4d-b8b5-cced671ae5fe",
      "region": "nrt",
      "subject": "Partial Outage",
      "start_date": "2022-06-28T21:07:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-06-28T21:07:00+00:00",
          "message": "An outage or maintenance window is affecting a subset of users in this region. Detailed outage information is available in the customer portal if this event is impacting your resources."
        }
      ]
    },
    {
      "id": "26564ebf-23cf-48f1-abac-2e2585bd8b55",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2022-07-09",
      "start_date": "2022-06-22T15:24:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-06-22T15:24:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-09 04:05:00 UTC\r\nEnd Time: 2022-07-09 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Chicago instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
