{
  "service_alerts": [
    {
      "id": "66e28402-66e5-405f-a0a0-f38a95990cc0",
      "region": "ord",
      "subject": "Chicago BareMetal Platform Emergency Maintenance ",
      "start_date": "2022-07-06T17:13:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-06T17:13:00+00:00",
          "message": "Event Type: BareMetal Platform Emergency Maintenance\r\n\r\nWe are performing system changes in the Chicago location during the following emergency maintenance window. \r\n\r\nStart Time: 2022-07-06 16:40:00 UTC\r\nEnd Time: 2022-07-06 20:40:00 UTC\r\n\r\nWe are currently performing Emergency Maintenance on our Bare Metal platform in our Chicago location.\r\n\r\nServers will remain powered on and there will be no interruption to Public or VPC network connectivity, however system controls will be affected.  During this Maintenance Window you will be unable to issue Power On/Off/Cycle commands, access the VNC Console, deploy new servers, or reinstall existing subscriptions.\r\n\r\nWe apologize for the inconvenience, but appreciate your understanding while we work to solve this issue."
        }
      ]
    },
    {
      "id": "f798d5d5-63f2-4f31-b465-79614af86ea6",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2022-07-11",
      "start_date": "2022-07-06T15:35:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-06T15:35:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-11 15:00:00 UTC\r\nEnd Time: 2022-07-11 20:00:00 UTC\r\n\r\n\r\nWe will be performing infrastructure upgrades in our Frankfurt location as part of an ongoing effort to maintain an ideal hosting environment.\r\n\r\nDuring this time, the following will be affected:\r\n\r\n• Bare Metal deploys will be disabled while maintenance is ongoing.\r\n• Server power actions and VNC console access may be affected.\r\n\r\nPreviously deployed servers in Frankfurt will remain online without interruption and will not be impacted by this event."
        }
      ]
    },
    {
      "id": "b13d6857-0d89-4ca6-bd31-d58dd6b7804a",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2022-07-13",
      "start_date": "2022-07-01T20:05:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-07-01T20:05:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-13 14:00:00 UTC\r\nEnd Time: 2022-07-13 20:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Frankfurt instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "8ea3177b-b318-4bf4-987f-ef2d48927ad8",
      "region": "dfw",
      "subject": "Dallas Scheduled Maintenance - 2022-07-06",
      "start_date": "2022-07-01T10:54:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-07-01T10:54:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Dallas location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-06 05:00:00 UTC\r\nEnd Time: 2022-07-06 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Dallas instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "26564ebf-23cf-48f1-abac-2e2585bd8b55",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2022-07-09",
      "start_date": "2022-06-22T15:24:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-06-22T15:24:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-07-09 04:05:00 UTC\r\nEnd Time: 2022-07-09 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Chicago instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    }
  ]
}
