{
  "service_alerts": [],
  "regions": {
    "ams": {
      "location": "Amsterdam",
      "country": "NL",
      "country_name": "Netherlands",
      "alerts": []
    },
    "atl": {
      "location": "Atlanta",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "4b67beb6-83eb-4fc2-9a22-20c2ce0054bb",
          "subject": "Atlanta Scheduled Maintenance - 2023-09-20",
          "status": "ongoing",
          "start_date": "2023-09-14T17:14:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-14T17:14:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-20 04:05:00 UTC\r\nEnd Time: 2023-09-20 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Atlanta instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
            }
          ]
        }
      ]
    },
    "blr": {
      "location": "Bangalore",
      "country": "IN",
      "country_name": "India",
      "alerts": []
    },
    "ord": {
      "location": "Chicago",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "184cd57e-543e-4462-ae2c-193cddcbebd9",
          "subject": "Chicago Scheduled Maintenance - 2023-09-12",
          "status": "resolved",
          "start_date": "2023-09-05T21:21:00+00:00",
          "updated_at": "2023-09-12T05:48:00+00:00",
          "entries": [
            {
              "updated_at": "2023-09-12T05:48:00+00:00",
              "message": "Line cards installed succesfully"
            },
            {
              "updated_at": "2023-09-05T21:21:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-12 05:00:00 UTC\r\nEnd Time: 2023-09-12 07:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "dfw": {
      "location": "Dallas",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "b1423796-32b7-4ed4-86b5-e068fed89b29",
          "subject": "Dallas Scheduled Maintenance - 2023-09-12",
          "status": "resolved",
          "start_date": "2023-08-30T16:47:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-08-30T16:47:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Dallas location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-12 22:00:00 UTC\r\nEnd Time: 2023-09-13 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Dallas instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
            }
          ]
        }
      ]
    },
    "del": {
      "location": "Delhi NCR",
      "country": "IN",
      "country_name": "India",
      "alerts": [
        {
          "id": "4ff8bde2-a1a3-4c6d-9c32-c643e73ba850",
          "subject": "Delhi NCR Scheduled Maintenance - 2023-09-12",
          "status": "resolved",
          "start_date": "2023-09-06T17:15:00+00:00",
          "updated_at": "2023-09-12T21:34:00+00:00",
          "entries": [
            {
              "updated_at": "2023-09-12T21:34:00+00:00",
              "message": "Upgrade ER1/2 in DEL1 to the new standard OS Junos: 22.2R3.15 completed Successful"
            },
            {
              "updated_at": "2023-09-06T17:15:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Delhi NCR location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-12 19:00:00 UTC\r\nEnd Time: 2023-09-12 23:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Delhi NCR instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "fra": {
      "location": "Frankfurt",
      "country": "DE",
      "country_name": "Germany",
      "alerts": [
        {
          "id": "8747869c-3145-4f89-846b-acd5042cc2a9",
          "subject": "Frankfurt Network Outage",
          "status": "resolved",
          "start_date": "2023-09-13T11:20:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-13T11:20:00+00:00",
              "message": "We are currently experiencing a partial outage in our Frankfurt location. Our network engineers are actively working with our upstream providers to restore connectivity as quickly as possible."
            }
          ]
        }
      ]
    },
    "hnl": {
      "location": "Honolulu",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "62b8a96b-4a05-4701-8c19-2f903706bcb7",
          "subject": "Honolulu Scheduled Maintenance - 2023-09-13",
          "status": "resolved",
          "start_date": "2023-09-06T17:30:00+00:00",
          "updated_at": "2023-09-13T12:31:00+00:00",
          "entries": [
            {
              "updated_at": "2023-09-13T12:31:00+00:00",
              "message": "Upgrade ER1/2 in HNL1 to the new standard OS Junos: 22.2R3.15 Completed Successful"
            },
            {
              "updated_at": "2023-09-06T17:30:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Honolulu location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-13 10:00:00 UTC\r\nEnd Time: 2023-09-13 14:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Honolulu instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "jnb": {
      "location": "Johannesburg",
      "country": "ZA",
      "country_name": "South Africa",
      "alerts": [
        {
          "id": "419741d1-0e46-4372-9f21-93ade756bd9d",
          "subject": "Johannesburg Scheduled Maintenance - 2023-09-18",
          "status": "ongoing",
          "start_date": "2023-09-08T16:22:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-08T16:22:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Johannesburg location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-18 22:00:00 UTC\r\nEnd Time: 2023-09-19 02:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Johannesburg instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "lhr": {
      "location": "London",
      "country": "GB",
      "country_name": "United Kingdom",
      "alerts": [
        {
          "id": "642657c4-3c36-4731-8d27-413edcf061c7",
          "subject": "London Scheduled Maintenance - 2023-09-26",
          "status": "ongoing",
          "start_date": "2023-09-14T18:31:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-14T18:31:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-26 23:05:00 UTC\r\nEnd Time: 2023-09-27 03:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
            }
          ]
        }
      ]
    },
    "lax": {
      "location": "Los Angeles",
      "country": "US",
      "country_name": "United States",
      "alerts": []
    },
    "mad": {
      "location": "Madrid",
      "country": "ES",
      "country_name": "Spain",
      "alerts": [
        {
          "id": "11b5d216-cd53-4b3b-a2e0-604019786b43",
          "subject": "Madrid Network Outage",
          "status": "ongoing",
          "start_date": "2023-09-12T10:44:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-12T10:44:00+00:00",
              "message": "We are currently experiencing a partial outage in our Madrid location. Our network engineers are actively working with our upstream providers to restore connectivity as quickly as possible."
            }
          ]
        }
      ]
    },
    "man": {
      "location": "Manchester",
      "country": "GB",
      "country_name": "United Kingdom",
      "alerts": []
    },
    "mel": {
      "location": "Melbourne",
      "country": "AU",
      "country_name": "Australia",
      "alerts": []
    },
    "mex": {
      "location": "Mexico City",
      "country": "MX",
      "country_name": "Mexico",
      "alerts": []
    },
    "mia": {
      "location": "Miami",
      "country": "US",
      "country_name": "United States",
      "alerts": []
    },
    "bom": {
      "location": "Mumbai",
      "country": "IN",
      "country_name": "India",
      "alerts": []
    },
    "ewr": {
      "location": "New Jersey",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "8cfc5dd4-d846-4e2a-b539-b4af3c27bbfd",
          "subject": "New Jersey Object Storage Outage - 2023-08-06",
          "status": "resolved",
          "start_date": "2023-08-06T07:18:00+00:00",
          "updated_at": "2023-09-13T12:02:00+00:00",
          "entries": [
            {
              "updated_at": "2023-09-13T12:02:00+00:00",
              "message": "As identified in a previous notice, New Jersey object storage is now usable again while investigations and improvements continue on the cluster.   This specific alert is a redundant notice."
            },
            {
              "updated_at": "2023-08-14T16:03:00+00:00",
              "message": "Hello,\r\n\r\nWe are providing an update on restoration progress regarding the extended outage to the Object Storage platform (VOBS) in the New Jersey (EWR) location.\r\n\r\nAt this time, we are continuing to work to bring VOBS EWR back to normal health. Some or all of your data may be accessible at this time, either constantly or intermittently. Rebalancing continues as anticipated and we expect to reach a state where acceptable read performance is available soon. As part of this, we are continuing to retrofit new, more performant hardware in VOBS EWR. Once we have achieved an acceptable level of read availability, we will work to restore write access, and lastly performance to normal levels. Please note that we are making every effort to safely expedite this process and minimize the additional impact time.\r\n\r\nThank you for your patience as we work through this outage.\r\n\r\nWe will continue to provide regular updates until normal performance is restored."
            },
            {
              "updated_at": "2023-08-09T19:26:00+00:00",
              "message": "Hello,\r\n\r\nPlease review the following information regarding the remediation of an extended outage to the Object Storage platform (VOBS) in the New Jersey (EWR) location. The outage occurred as a result of surging demand before our planned incremental hardware retrofit (to match our NVMe based clusters in other locations) could be completed and the cluster was not able to consistently perform routine balancing operations.  \r\n\r\nOur team’s restoration priorities are preventing data loss, followed by data availability, restoring write access, and finally performance. While user access is limited, the cluster is actively rebalancing and is expected to reach an acceptable read state soon. In the meantime, you should find that objects can be read with intermittent success, retries may produce the best results.\r\n\r\n\r\nVOBS in other locations (SJC1, AMS1, BLR1 & DEL1) already have high performance NVMe storage in place and we recommend creating a new VOBS subscription there for your workloads while the extended maintenance efforts in EWR are completed. While we expect your access to VOBS EWR to be restored soon, the platform will be under higher load than normal during the hardware replacement process over the next few weeks. \r\n\r\nWe will provide regular updates until normal read/write access is restored."
            },
            {
              "updated_at": "2023-08-06T07:18:00+00:00",
              "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Storage team is investigating a partial outage situation with our Object Storage infrastructure. The following services may be impacted by this event:\r\n\r\n- Object Storage Subscription management\r\n- Adding or removing buckets\r\n- S3 client issues\r\n\r\nWe are working quickly to restore service to its optimal state."
            }
          ]
        }
      ]
    },
    "itm": {
      "location": "Osaka",
      "country": "JP",
      "country_name": "Japan",
      "alerts": []
    },
    "cdg": {
      "location": "Paris",
      "country": "FR",
      "country_name": "France",
      "alerts": []
    },
    "scl": {
      "location": "Santiago",
      "country": "CL",
      "country_name": "Chile",
      "alerts": []
    },
    "sao": {
      "location": "São Paulo",
      "country": "BR",
      "country_name": "Brazil",
      "alerts": [
        {
          "id": "43d163bf-b3fd-40d8-b247-ef0e326acf1a",
          "subject": "São Paulo Scheduled Maintenance - 2023-09-15",
          "status": "ongoing",
          "start_date": "2023-09-06T16:06:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-06T16:06:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the São Paulo location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-15 03:00:00 UTC\r\nEnd Time: 2023-09-15 07:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to São Paulo instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
            }
          ]
        }
      ]
    },
    "sea": {
      "location": "Seattle",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "50efc496-50c2-4f64-9fde-f143d86c7b68",
          "subject": "Seattle Block Storage Maintenance - 2023-09-13",
          "status": "resolved",
          "start_date": "2023-09-08T14:45:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-08T14:45:00+00:00",
              "message": "Event Type: Seattle Block Storage Infrastructure Maintenance\r\nStart Time: 2023-09-13 11:00:00 America/EST\r\nEnd Time: 2023-09-13 17:00:00 America/EST\r\n\r\nOur Cloud Storage team will be performing upgrades to our Seattle Block Storage infrastructure starting at 2023-09-13 11:00:00 EST. During this maintenance window, creating, attaching, resizing, and deletion of Block Storage volumes may be temporarily unavailable.\r\n\r\nThe Vultr Storage team also plans to migrate existing block storage volumes to a new cluster. The process will require detaching your block storage volume and then reattaching the volume in the new cluster. \r\n\r\nIn order to guarantee no loss of data, please detach your block storage manually before the maintenance window begins to ensure there is no data actively being written to it when we detach it from the current cluster. \r\n\r\nOnce the maintenance window ends please check your block storage manually to ensure it is working properly. If you encounter any issues with re-attaching your storage volume first please attempt to re-mount the volume or reboot your VPS. If this doesn't work please open a support ticket. \r\n\r\nThank you"
            }
          ]
        }
      ]
    },
    "icn": {
      "location": "Seoul",
      "country": "KR",
      "country_name": "Korea, Republic of",
      "alerts": []
    },
    "sjc": {
      "location": "Silicon Valley",
      "country": "US",
      "country_name": "United States",
      "alerts": [
        {
          "id": "8e4b6b48-066d-42d9-b7bc-cf8639cdbc0c",
          "subject": "Silicon Valley Scheduled Maintenance - 2023-09-21",
          "status": "ongoing",
          "start_date": "2023-09-14T17:41:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-14T17:41:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Silicon Valley location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-21 07:00:00 UTC\r\nEnd Time: 2023-09-21 11:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Silicon Valley instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
            }
          ]
        }
      ]
    },
    "sgp": {
      "location": "Singapore",
      "country": "SG",
      "country_name": "Singapore",
      "alerts": [
        {
          "id": "a32c33f1-5a62-46e1-ae7c-12162342e230",
          "subject": "Singapore Object Storage Outage - 2023-08-04",
          "status": "resolved",
          "start_date": "2023-08-03T01:46:00+00:00",
          "updated_at": "2023-09-13T12:14:00+00:00",
          "entries": [
            {
              "updated_at": "2023-09-13T12:14:00+00:00",
              "message": "Singapore object storage is functioning normally, and clients may resume their usual activity.   A development plan to increase future performance and stability on all object clusters is in progress as well.   Thank you for your patience on this and related matters."
            },
            {
              "updated_at": "2023-08-03T01:46:00+00:00",
              "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Storage team is investigating a partial outage situation with our Object Storage infrastructure. The following services may be impacted by this event:\r\n\r\n- Object Storage Subscription management\r\n- Adding or removing buckets\r\n- S3 client issues\r\n\r\nWe are working quickly to restore service to its optimal state."
            }
          ]
        }
      ]
    },
    "sto": {
      "location": "Stockholm",
      "country": "SE",
      "country_name": "Sweden",
      "alerts": [
        {
          "id": "d2510efc-f5fb-4271-8d26-5eec215ae18d",
          "subject": "Stockholm Scheduled Maintenance - 2023-09-19",
          "status": "ongoing",
          "start_date": "2023-09-12T19:07:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-12T19:07:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Stockholm location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-19 21:30:00 UTC\r\nEnd Time: 2023-09-20 01:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Stockholm instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "syd": {
      "location": "Sydney",
      "country": "AU",
      "country_name": "Australia",
      "alerts": []
    },
    "tlv": {
      "location": "Tel Aviv",
      "country": "IL",
      "country_name": "Israel",
      "alerts": [
        {
          "id": "106176e0-24e5-4921-8377-eef7ab24deeb",
          "subject": "Tel Aviv Scheduled Maintenance - 2023-09-20",
          "status": "ongoing",
          "start_date": "2023-09-12T19:09:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-12T19:09:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Tel Aviv location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-20 21:30:00 UTC\r\nEnd Time: 2023-09-21 01:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Tel Aviv instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "nrt": {
      "location": "Tokyo",
      "country": "JP",
      "country_name": "Japan",
      "alerts": []
    },
    "yto": {
      "location": "Toronto",
      "country": "CA",
      "country_name": "Canada",
      "alerts": [
        {
          "id": "e75522ff-1acf-480d-885d-98fa2b276b32",
          "subject": "Toronto Scheduled Maintenance - 2023-09-22",
          "status": "ongoing",
          "start_date": "2023-09-12T19:25:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-12T19:25:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Toronto location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-22 04:05:00 UTC\r\nEnd Time: 2023-09-22 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Toronto instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    },
    "waw": {
      "location": "Warsaw",
      "country": "PL",
      "country_name": "Poland",
      "alerts": [
        {
          "id": "90171287-fe69-477c-b334-d4452ed79935",
          "subject": "Warsaw Scheduled Maintenance - 2023-09-18",
          "status": "ongoing",
          "start_date": "2023-09-12T19:04:00+00:00",
          "updated_at": "",
          "entries": [
            {
              "updated_at": "2023-09-12T19:04:00+00:00",
              "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Warsaw location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-18 21:30:00 UTC\r\nEnd Time: 2023-09-19 01:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Warsaw instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
            }
          ]
        }
      ]
    }
  }
}
