{
  "service_alerts": [
    {
      "id": "dcd23ab2-5902-4a87-af92-4aedc546b24a",
      "region": "global",
      "subject": "GPU Deploy Quality",
      "start_date": "2023-11-15T09:19:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-11-15T09:19:00+00:00",
          "message": "We are currently aware of multiple issues degrading the deploy quality of GPU products at this time. We are working diligently to restore functionality to our deploy images."
        }
      ]
    },
    {
      "id": "8ae26184-33db-4802-918b-bc55048949c2",
      "region": "sjc",
      "subject": "Silicon Valley Snapshots & ISOs Maintenance - 2023-11-13",
      "start_date": "2023-11-08T20:57:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-11-08T20:57:00+00:00",
          "message": "Event Type: Storage Infrastructure Maintenance\r\nStart Time: 2023-11-13 13:00:00 America/Los_Angeles\r\nEnd Time: 2023-11-14 19:00:00 America/Los_Angeles\r\n\r\nOur Cloud Storage team will be performing upgrades to our Silicon Valley deployment infrastructure starting at 2023-11-13 21:00:00 UTC. During this maintenance window, new deployments, snapshot functionality, HDD Block devices, and custom ISOs may be temporarily unavailable.\r\n\r\nPreviously deployed servers in Silicon Valley will remain online without interruption and will not be impacted by this event."
        }
      ]
    },
    {
      "id": "c79501db-32db-49b6-a8bb-46c0529f3452",
      "region": "tlv",
      "subject": "Potential service disruption in Tel Aviv",
      "start_date": "2023-10-17T16:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-10-17T16:18:00+00:00",
          "message": "The Constant Company, creator of Vultr, is aware of and following the situation in Israel. At this time we do not expect any disruption of service in our Tel Aviv location.  We will continue to closely monitor services as the situation evolves, and we will advise our customers of any changes which have the potential to impact service delivery.\r\n\r\nWe believe this is a crucial time to remind our customers about the importance of the 3-2-1 Backup Strategy for safeguarding all critical data. Please see the case study here for more information: https://www.vultr.com/docs/case-study-use-a-321-backup-strategy-at-vultr/\r\n\r\nPlease note that Vultr Snapshots and Backups are stored in the same location as the instance they are made from, however when you deploy a new instance from them in a different location, they will be automatically transferred and stored in the new location as well."
        }
      ]
    }
  ]
}
