{
  "service_alerts": [
    {
      "id": "dc9ccb05-a63c-4377-ae07-4f37ca4051e8",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2021-02-18",
      "start_date": "2021-02-11T18:26:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-02-11T18:26:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-02-18 09:00:00 UTC\r\nEnd Time: 2021-02-18 13:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "1c15a012-3afc-4162-a673-0a9e758fe603",
      "region": "ewr",
      "subject": "New Jersey Scheduled Maintenance - 2021-02-18",
      "start_date": "2021-02-10T21:10:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-02-10T21:10:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the New Jersey location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-02-18 09:00:00 UTC\r\nEnd Time: 2021-02-18 13:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, New Jersey instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "56f30d9f-10bb-4bee-aa17-ae8bc9fa1550",
      "region": "atl",
      "subject": "Atlanta Scheduled Maintenance - 2021-03-10",
      "start_date": "2021-02-02T17:44:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-02-02T17:44:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-03-10 08:00:00 UTC\r\nEnd Time: 2021-03-10 12:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Atlanta instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "0d1152f3-cc87-4eda-99d1-f968adae2509",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2021-03-04",
      "start_date": "2021-02-02T16:24:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-02-02T16:24:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-03-04 02:00:00 UTC\r\nEnd Time: 2021-03-04 06:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Frankfurt instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "5978c4b1-45aa-4568-aa02-8f736de8e23e",
      "region": "cdg",
      "subject": "Paris Scheduled Maintenance - 2021-02-25",
      "start_date": "2021-02-02T16:21:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2021-02-02T16:21:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Paris location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-02-25 02:00:00 UTC\r\nEnd Time: 2021-02-25 06:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Paris instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "3175e934-ec47-4fbb-ae38-dc245414dcfa",
      "region": "sea",
      "subject": "Seattle Scheduled Maintenance - 2021-02-17",
      "start_date": "2021-02-02T16:05:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2021-02-02T16:05:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Seattle location during the following scheduled maintenance window. \r\n\r\nStart Time: 2021-02-17 11:00:00 UTC\r\nEnd Time: 2021-02-17 15:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Seattle instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
