{
  "service_alerts": [
    {
      "id": "6a9a6ff6-5d0a-4b69-91de-27cae94bd7d3",
      "region": "ewr",
      "subject": "New Jersey Emergency Maintenance - 2023-12-14",
      "start_date": "2023-12-13T16:04:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-12-13T16:04:00+00:00",
          "message": "Event Type: Network Emergency\r\n\r\nWe are performing system changes in the New Jersey location during the following emergency maintenance window. \r\n\r\nStart Time: 2023-12-14 05:00:00 UTC\r\nEnd Time: 2023-12-14 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, New Jersey instances may be unreachable for some, or all, of the emergency maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "c79501db-32db-49b6-a8bb-46c0529f3452",
      "region": "tlv",
      "subject": "Potential service disruption in Tel Aviv",
      "start_date": "2023-10-17T16:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-10-17T16:18:00+00:00",
          "message": "The Constant Company, creator of Vultr, is aware of and following the situation in Israel. At this time we do not expect any disruption of service in our Tel Aviv location.  We will continue to closely monitor services as the situation evolves, and we will advise our customers of any changes which have the potential to impact service delivery.\r\n\r\nWe believe this is a crucial time to remind our customers about the importance of the 3-2-1 Backup Strategy for safeguarding all critical data. Please see the case study here for more information: https://www.vultr.com/docs/case-study-use-a-321-backup-strategy-at-vultr/\r\n\r\nPlease note that Vultr Snapshots and Backups are stored in the same location as the instance they are made from, however when you deploy a new instance from them in a different location, they will be automatically transferred and stored in the new location as well."
        }
      ]
    }
  ]
}
