{
  "service_alerts": [
    {
      "id": "5d8e37c2-9865-4338-b70a-f90713833ee0",
      "region": "ewr",
      "subject": "New Jersey Scheduled Maintenance - 2025-04-15",
      "start_date": "2025-04-09T16:07:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2025-04-09T16:07:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the New Jersey location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-04-15 04:05:00 UTC\r\nEnd Time: 2025-04-15 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to New Jersey instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "d393df95-8fab-4d30-8814-fc7a5ba27d18",
      "region": "yto",
      "subject": "Toronto Scheduled Maintenance - 2025-04-22",
      "start_date": "2025-04-08T17:15:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-04-08T17:15:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Toronto location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-04-22 03:00:00 UTC\r\nEnd Time: 2025-04-22 07:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Toronto instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "6de15883-8761-4f69-96f4-f5e531c4da68",
      "region": "jnb",
      "subject": "Johannesburg Scheduled Maintenance - 2025-04-17",
      "start_date": "2025-04-07T17:40:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-04-07T17:40:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Johannesburg location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-04-17 23:00:00 UTC\r\nEnd Time: 2025-04-18 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Johannesburg instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "1811d2fa-3e3a-47d1-b3e6-6ebdae65ec21",
      "region": "fra",
      "subject": "Frankfurt Scheduled Maintenance - 2025-04-16",
      "start_date": "2025-04-07T17:30:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-04-07T17:30:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Frankfurt location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-04-16 23:00:00 UTC\r\nEnd Time: 2025-04-17 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Frankfurt instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "61da652e-1144-4e48-a44a-6bb55fa0b4b4",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2025-04-15",
      "start_date": "2025-04-07T16:52:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-04-07T16:52:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2025-04-15 05:00:00 UTC\r\nEnd Time: 2025-04-15 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "14b1c3a4-bd60-4429-92e2-a8066633f80e",
      "region": "global",
      "subject": "CDN Outage",
      "start_date": "2025-04-07T15:01:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-04-07T15:01:00+00:00",
          "message": "We are currently experiencing a partial outage in Vultr CDN. Our Engineers are actively working to restore service as quickly as possible."
        }
      ]
    },
    {
      "id": "03f5c581-82e9-4d72-ad27-d19547011108",
      "region": "nrt",
      "subject": "Tokyo Degraded Network Performance",
      "start_date": "2025-04-07T13:18:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-04-07T13:18:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Tokyo location. Our network engineers are actively working with our upstream providers to resolve the issue as quickly as possible."
        }
      ]
    },
    {
      "id": "2b334efc-327b-407c-a5f4-c6dd40a95344",
      "region": "mia",
      "subject": "Miami Degraded Network Performance",
      "start_date": "2025-03-20T11:04:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2025-03-20T11:04:00+00:00",
          "message": "We are currently experiencing degraded network performance in our Miami location. Our network engineers are actively working with our upstream providers to resolve the issue as quickly as possible."
        }
      ]
    }
  ]
}
