{
  "service_alerts": [
    {
      "id": "aac2bfef-f779-492b-8e34-054089c80777",
      "region": "global",
      "subject": "Global VKE Infrastructure Maintenance",
      "start_date": "2022-04-06T19:43:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-04-06T19:43:00+00:00",
          "message": "Event Type: VKE Maintenance\r\n\r\nWe are performing Vultr Kubernetes Engine(VKE) system changes in the ALL regions during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-04-11 23:00:00 UTC\r\nEnd Time: 2022-04-12 01:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, new VKE clusters will be unable to be created. Existing VKE clusters will be unable to be destroyed. Existing VKE cluster Node Pools will be unable to be created, destroyed, scaled up, or scaled down for the duration of the maintenance. \r\n\r\nExisting VKE clusters will remain otherwise functional."
        }
      ]
    },
    {
      "id": "58f2ba0d-09eb-418f-b965-0142deb70b86",
      "region": "yto",
      "subject": "Toronto Infrastructure Upgrades - 2022-04-13",
      "start_date": "2022-04-06T18:00:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-04-06T18:00:00+00:00",
          "message": "Our engineering team will be performing upgrades to our Toronto deployment infrastructure starting at 2022-04-13 21:00:00 UTC. During this maintenance window, new deployments and snapshot functionality may be temporarily unavailable. \r\n\r\nPreviously deployed servers in Toronto will remain online without interruption and will not be impacted by this event."
        }
      ]
    },
    {
      "id": "b061e7df-904d-4550-b2e8-8e4a1fd91824",
      "region": "syd",
      "subject": "Sydney Scheduled Maintenance - 2022-04-12",
      "start_date": "2022-04-06T16:15:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-04-06T16:15:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Sydney location during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-04-12 15:00:00 UTC\r\nEnd Time: 2022-04-12 19:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Sydney instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
