{
  "service_alerts": [
    {
      "id": "7e7bc139-dc2e-4247-8fff-0acae31e6e31",
      "region": "ord",
      "subject": "Chicago Scheduled Maintenance - 2022-06-11",
      "start_date": "2022-06-03T20:37:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-06-03T20:37:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Chicago locationssssss during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-06-11 04:05:00 UTC\r\nEnd Time: 2022-06-11 09:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Chicago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "774cb11a-f145-4c2e-827b-0bdba8516b65",
      "region": "sgp",
      "subject": "Singapore Scheduled Maintenance - 2022-06-09",
      "start_date": "2022-06-03T20:17:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2022-06-03T20:17:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Singapore locationsssss during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-06-09 16:00:00 UTC\r\nEnd Time: 2022-06-09 20:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Singapore instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "0634d500-0ff3-4aaa-8f78-6b453d59406a",
      "region": "mia",
      "subject": "Miami Scheduled Maintenance - 2022-06-06",
      "start_date": "2022-06-01T18:52:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2022-06-01T18:52:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Miami locationss during the following scheduled maintenance window. \r\n\r\nStart Time: 2022-06-06 14:30:00 UTC\r\nEnd Time: 2022-06-06 16:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Miami  instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
