{
  "service_alerts": [
    {
      "id": "961e9663-fa8c-4591-88ac-e5f88600ab81",
      "region": "mex",
      "subject": "Mexico City Scheduled Maintenance - 2023-10-03",
      "start_date": "2023-09-25T20:53:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-09-25T20:53:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Mexico City location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-10-03 06:00:00 UTC\r\nEnd Time: 2023-10-03 10:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Mexico City instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "a91a939d-e2fe-4e84-8496-d18cf001462d",
      "region": "nrt",
      "subject": "Tokyo Scheduled Maintenance - 2023-09-28",
      "start_date": "2023-09-22T19:35:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-09-22T19:35:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Tokyo location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-28 15:00:00 UTC\r\nEnd Time: 2023-09-28 19:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Tokyo instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "2757e379-f192-4c48-a315-33250bce977b",
      "region": "ewr",
      "subject": "New Jersey Object Storage Outage - 2023-09-22",
      "start_date": "2023-09-22T07:26:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-09-22T07:26:00+00:00",
          "message": "Event Type: Service Degraded Performance and Availability\r\n\r\nOur Cloud Storage team is investigating a partial outage situation with our Object Storage infrastructure. The following services may be impacted by this event:\r\n\r\n- Object Storage Subscription management\r\n- Adding or removing buckets\r\n- S3 client issues\r\n\r\nWe are working quickly to restore service to its optimal state."
        }
      ]
    },
    {
      "id": "ca01fb16-3b89-4f18-9cf9-8d016d8f1174",
      "region": "sea",
      "subject": "Seattle Block Storage Maintenance - VPS Downtime - 2023-09-26",
      "start_date": "2023-09-21T20:57:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-09-21T20:57:00+00:00",
          "message": "Event Type: Block Storage Infrastructure Maintenance\r\nStart Time: 2023-09-26 18:00:00 America/EST\r\nEnd Time: 2023-09-27 02:00:00 America/EST\r\n\r\nOur Cloud Storage team will be performing one last round of Maintenance starting at 2023-09-26 21:00:00 UTC. During this maintenance window, creating, attaching, resizing, and deletion of HDD Block Storage volumes may be temporarily unavailable.\r\n\r\nDuring this maintenance window we will be performing the final migration of your block storage data to our new cluster. The process will involve powering down your VM, detaching the storage, copying it to the new cluster, and finally re-attach the block storage and restart your VM.\r\n\r\nWe can not specify when exactly your VM will need to be powered off as we are moving one block at a time but your total downtime should be anywhere from <5 minutes to 30 depending on the size of your block storage volume.\r\n\r\nPlease accept our apologies for any inconvenience this may cause. \r\n\r\nIf you have any additional questions please open a support ticket."
        }
      ]
    },
    {
      "id": "9c339dd5-3f8d-462a-b8ea-26cded8f27d5",
      "region": "atl",
      "subject": "Atlanta Scheduled Maintenance - 2023-09-27",
      "start_date": "2023-09-21T16:58:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-09-21T16:58:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Atlanta location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-27 04:05:00 UTC\r\nEnd Time: 2023-09-27 08:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Atlanta instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "2cf16757-e75e-47fd-9e3b-2a2d6065e049",
      "region": "scl",
      "subject": "Santiago Scheduled Maintenance - 2023-09-27",
      "start_date": "2023-09-19T21:54:00+00:00",
      "updated_at": "2023-09-27T05:30:00+00:00",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-09-27T05:30:00+00:00",
          "message": "MNT Completed - Upgrade ER1/2 in SCL1 to the new standard OS Junos: 22.2R3.15, Only ER2 was able to be upgraded ER1 has a bad/not present SSD1 and was unable to be upgraded. tried deferent commands and reload to activate SSD1 no luck. Tried to open a Juniper case but MX204 is not have a support contract."
        },
        {
          "updated_at": "2023-09-19T21:54:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Santiago location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-27 03:00:00 UTC\r\nEnd Time: 2023-09-27 07:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Santiago instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "a5781196-ed3c-4a42-84c1-d82be0e34de4",
      "region": "man",
      "subject": "Manchester Scheduled Maintenance - 2023-09-25",
      "start_date": "2023-09-19T18:40:00+00:00",
      "updated_at": "2023-09-26T02:49:00+00:00",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-09-26T02:49:00+00:00",
          "message": "Upgrade ER1/2 in MAN1 to the new standard OS Junos: 22.2R3.15 had to rollback to previous OS has FPC would not come online with the new OS."
        },
        {
          "updated_at": "2023-09-19T18:40:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Manchester location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-25 23:00:00 UTC\r\nEnd Time: 2023-09-26 03:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Manchester instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "642657c4-3c36-4731-8d27-413edcf061c7",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2023-09-26",
      "start_date": "2023-09-14T18:31:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-09-14T18:31:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-09-26 23:05:00 UTC\r\nEnd Time: 2023-09-27 03:05:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "11b5d216-cd53-4b3b-a2e0-604019786b43",
      "region": "mad",
      "subject": "Madrid Network Outage",
      "start_date": "2023-09-12T10:44:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-09-12T10:44:00+00:00",
          "message": "We are currently experiencing a partial outage in our Madrid location. Our network engineers are actively working with our upstream providers to restore connectivity as quickly as possible."
        }
      ]
    }
  ]
}
