{
  "service_alerts": [
    {
      "id": "a586aa11-440e-43c4-8e15-69921cd73c26",
      "region": "sto",
      "subject": "Stockholm Scheduled Maintenance - 2023-04-11",
      "start_date": "2023-03-29T16:11:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-29T16:11:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Stockholm location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-04-11 02:00:00 UTC  (04:00 local time)\r\nEnd Time: 2023-04-11 04:00:00 UTC  (06:00 local time)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Stockholm instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "c5e43ca8-e5ef-4e55-9f1f-5da7d14e75c7",
      "region": "ams",
      "subject": "Amsterdam Scheduled Maintenance - 2023-04-11",
      "start_date": "2023-03-29T16:09:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-29T16:09:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Amsterdam location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-04-11 00:00:00 UTC  (02:00 local time)\r\nEnd Time: 2023-04-11 02:00:00 UTC  (04:00 local time)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Amsterdam instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "dd1fe3db-e262-4935-b567-4c4fea51712a",
      "region": "icn",
      "subject": "Seoul Scheduled Maintenance - 2023-04-11",
      "start_date": "2023-03-29T16:05:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-03-29T16:05:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Seoul location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-04-10 19:00:00 UTC (2023-04-11 04:00 local)\r\nEnd Time: 2023-04-10 21:00:00 UTC (2023-04-11 06:00 local)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to Seoul instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "05334518-aded-4083-a356-0a6ea0760363",
      "region": "lhr",
      "subject": "London Scheduled Maintenance - 2023-03-30",
      "start_date": "2023-03-23T15:24:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-03-23T15:24:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the London location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-03-30 24:00:00 UTC\r\nEnd Time: 2023-03-30 04:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to London instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "5b6e384c-8b75-499c-9c6d-669c6ac64fd1",
      "region": "sgp",
      "subject": "Singapore Scheduled Maintenance - 2023-03-28",
      "start_date": "2023-03-21T15:58:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-03-21T15:58:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the Singapore location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-03-28 16:30:00 UTC\r\nEnd Time: 2023-03-28 20:30:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Singapore instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
