{
  "service_alerts": [
    {
      "id": "fbb1923c-5382-43d4-8798-4f09ad3c8a89",
      "region": "ewr",
      "subject": "New Jersey Scheduled Maintenance - 2023-02-16",
      "start_date": "2023-02-07T20:36:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-02-07T20:36:00+00:00",
          "message": "Event Type: Network Upgrade\r\n\r\nWe are performing system changes in the New Jersey location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-02-16 05:00:00 UTC\r\nEnd Time: 2023-02-16 09:00:00 UTC\r\n\r\nWe schedule higher impact maintenance events during off-peak times to reduce impact to customer infrastructure. Our engineers make every effort to minimize system impact, however, network reachability to New Jersey instances may be affected for some, or all, of the scheduled maintenance window as we perform this work. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact at all while the work is performed."
        }
      ]
    },
    {
      "id": "d9c35d02-0938-4f81-b62a-6044de1f0632",
      "region": "mel",
      "subject": "Melbourne Scheduled Maintenance - 2023-02-08",
      "start_date": "2023-02-03T22:53:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-02-03T22:53:00+00:00",
          "message": "Event Type: Transit Provider Network Maintenance\r\n\r\nOur of our Internet transit providers for Melbourne has scheduled work during this maintenance window, with an expected duration of 90 minutes. Our other connectivity should keep the Melbourne data center on the net, but disruption is possible.\r\n\r\nStart Time: 2023-02-08 16:00:00 UTC  (03:00 Melbourne)\r\nEnd Time: 2023-02-08 20:00:00 UTC  (07:00 Melbourne)\r\n\r\nNetwork reachability to Melbourne instances may be affected for some, or all, of the scheduled maintenance window as this work is performed. While it’s important to be aware of start and end times of the maintenance window, due to our redundant network architecture, our engineers expect that you may see little to no impact due to this work."
        }
      ]
    },
    {
      "id": "093bd67e-d2d1-4ea2-be0e-3af6f334b167",
      "region": "dfw",
      "subject": "Dallas Scheduled Maintenance - 2023-02-09",
      "start_date": "2023-02-02T17:09:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-02-02T17:09:00+00:00",
          "message": "Event Type: Network Reconfiguration\r\n\r\nWe are performing system changes in the Dallas location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-02-09 07:00:00 UTC  (01:00 Dallas)\r\nEnd Time: 2023-02-09 08:00:00 UTC  (02:00 Dallas)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Dallas instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "95429a6e-330b-41d7-815e-52b7ba56d9cb",
      "region": "sjc",
      "subject": "Silicon Valley Scheduled Maintenance - 2023-02-09",
      "start_date": "2023-02-02T17:09:00+00:00",
      "updated_at": "",
      "status": "ongoing",
      "entries": [
        {
          "updated_at": "2023-02-02T17:09:00+00:00",
          "message": "Event Type: Network Reconfiguration\r\n\r\nWe are performing system changes in the Silicon Valley location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-02-09 08:00:00 UTC  (00:00 San Jose)\r\nEnd Time: 2023-02-09 10:00:00 UTC  (02:00 San Jose)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Silicon Valley instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "dc6d48b1-de76-4e35-b8ca-25553e59363d",
      "region": "cdg",
      "subject": "Paris Scheduled Maintenance - 2023-02-09",
      "start_date": "2023-02-02T17:08:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-02-02T17:08:00+00:00",
          "message": "Event Type: Network Reconfiguration\r\n\r\nWe are performing system changes in the Paris location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-02-09 03:00:00 UTC  (04:00 Paris)\r\nEnd Time: 2023-02-09 05:00:00 UTC  (06:00 Paris)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Paris instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    },
    {
      "id": "4d358124-fd0a-4531-9af7-049415da49c8",
      "region": "nrt",
      "subject": "Tokyo Scheduled Maintenance - 2023-02-09",
      "start_date": "2023-02-02T17:08:00+00:00",
      "updated_at": "",
      "status": "resolved",
      "entries": [
        {
          "updated_at": "2023-02-02T17:08:00+00:00",
          "message": "Event Type: Network Reconfiguration\r\n\r\nWe are performing system changes in the Tokyo location during the following scheduled maintenance window. \r\n\r\nStart Time: 2023-02-08 19:00:00 UTC  (2023-02-09 04:00 Tokyo)\r\nEnd Time: 2023-02-08 21:00:00 UTC  (2023-02-09 06:00 Tokyo)\r\n\r\nWe schedule higher impact maintenance events during off-peak times to maintain our ideal hosting environment. Our engineers make every effort to minimize system impact; however, Tokyo instances may be unreachable for some, or all, of the scheduled maintenance window as we perform network, firmware, or host upgrades."
        }
      ]
    }
  ]
}
